In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
from matplotlib import style
style.use('ggplot')

Step 1: Read In Data Set and Explore Data
We need to read in the data set and get a feel to what data needs to be cleaned

In [2]:
df = pd.read_csv('data_set/Meteorite_Landings.csv')
df.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,1/1/1951 0:00,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,1/1/1952 0:00,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1/1/1976 0:00,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,1/1/1902 0:00,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [3]:
# For exploring the data
print("Size of DataSet(rows, columns): ", df.shape)
print()
print("Quick Stats of Dataset: ", df.info())
print()
print("Columns of Dataset: ", df.columns)

Size of DataSet(rows, columns):  (45716, 10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
name           45716 non-null object
id             45716 non-null int64
nametype       45716 non-null object
recclass       45716 non-null object
mass (g)       45585 non-null float64
fall           45716 non-null object
year           45425 non-null object
reclat         38401 non-null float64
reclong        38401 non-null float64
GeoLocation    38401 non-null object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB
Quick Stats of Dataset:  None

Columns of Dataset:  Index(['name', 'id', 'nametype', 'recclass', 'mass (g)', 'fall', 'year',
       'reclat', 'reclong', 'GeoLocation'],
      dtype='object')

Looking at the describe() there seems to be null values in the mass, year, reclong, reclat, and GeoLocation columns. Let's use the following command down below just to make sure

Step 2: Drop null values
The first real step in cleaning your data is dropping null values

In [4]:
pd.isnull(df).sum() # check for NaN's and None's

name              0
id                0
nametype          0
recclass          0
mass (g)        131
fall              0
year            291
reclat         7315
reclong        7315
GeoLocation    7315
dtype: int64

In [5]:
df.dropna(axis=0, how='any', inplace=True)
pd.isnull(df).sum() # drop all missing values inside of the data set

name           0
id             0
nametype       0
recclass       0
mass (g)       0
fall           0
year           0
reclat         0
reclong        0
GeoLocation    0
dtype: int64

Data can also be replaced by using df.replace(to_replace=None, value=None) but that won't be necessary with this data set. Note a feature/attribute/column can also be dropped if more than %90 of the rows have null values with a simple df.drop(df['feature_name'], axis=1).

Step 3 : Dropping Irrelevenat Features
Not all features/attributes/columns are relevant to your goal, the best way is to figure out what your end goal is and determine what is absolutley necessary to achieve that

In [6]:
df.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,1/1/1951 0:00,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,1/1/1952 0:00,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1/1/1976 0:00,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,1/1/1902 0:00,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [7]:
print(df.fall.unique()) # fall just tracks if the meteorite was seen falling towards the earth (fell)  
print() # or if it was found before the fall (found)
print(df['fall'].value_counts()) # displays amount of unqiue values for each

['Fell' 'Found']

Found    37050
Fell      1065
Name: fall, dtype: int64

In [8]:
print(df.nametype.unique())
print()
print(df['nametype'].value_counts()) # we do the same analysis with name type

['Valid' 'Relict']

Valid     38094
Relict       21
Name: nametype, dtype: int64

In [9]:
print(df.recclass.unique()) # recclass is the class of meteorite
print() # this might come in handy later but we may need to drop it later 
print(df['recclass'].value_counts()) # we will keep it for now

['L5' 'H6' 'EH4' 'Acapulcoite' 'L6' 'LL3-6' 'H5' 'L' 'Diogenite-pm' 'H4'
 'H' 'Iron, IVA' 'CR2-an' 'LL5' 'CI1' 'L/LL4' 'Eucrite-mmict' 'CV3'
 'Ureilite-an' 'Stone-uncl' 'L3' 'Angrite' 'LL6' 'L4' 'Aubrite'
 'Iron, IIAB' 'Iron, IAB-sLL' 'Iron, ungrouped' 'CM2' 'Mesosiderite-A1'
 'LL4' 'C2-ung' 'LL3.8' 'Howardite' 'Eucrite-pmict' 'Diogenite' 'LL3.15'
 'LL3.9' 'Iron, IAB-MG' 'H/L3.9' 'Eucrite' 'H4-an' 'L/LL6' 'Iron, IIIAB'
 'OC' 'H/L4' 'H4-5' 'L3.7' 'LL3.4' 'Martian (chassignite)' 'EL6' 'H3.8'
 'H3-5' 'H5-6' 'Mesosiderite' 'H5-7' 'L3-6' 'H4-6' 'Ureilite' 'Iron, IID'
 'Mesosiderite-A3/4' 'CO3.3' 'H3' 'EH3/4-an' 'Iron, IIE' 'L/LL5' 'H3.7'
 'CBa' 'H4/5' 'H3/4' 'H?' 'H3-6' 'L3.4' 'Iron, IAB-sHL' 'L3.7-6' 'EH7-an'
 'Iron' 'CR2' 'CO3.2' 'K3' 'L5/6' 'CK4' 'Iron, IIE-an' 'L3.6' 'LL3.2'
 'CO3.5' 'Lodranite' 'Mesosiderite-A3' 'L3-4' 'H5/6' 'Pallasite, PMG'
 'Eucrite-cm' 'Pallasite' 'L5-6' 'CO3.6' 'Martian (nakhlite)' 'LL3.6'
 'C3-ung' 'H3-4' 'CO3.4' 'EH3' 'Iron, IAB-ung' 'Winonaite' 'LL'
 'Eucrite-br' 'Iron, IIF' 'R3.8-6' 'L4-6' 'EH5' 'LL3.00' 'H3.4'
 'Martian (shergottite)' 'Achondrite-ung' 'LL3.3' 'C' 'H/L3.6'
 'Iron, IIIAB-an' 'LL7' 'Mesosiderite-B2' 'LL4-6' 'CO3.7' 'L/LL6-an'
 'Iron, IAB complex' 'Pallasite, PMG-an' 'H3.9/4' 'L3.8' 'LL5-6' 'LL3.8-6'
 'L3.9' 'L4-5' 'L3-5' 'LL4/5' 'L4/5' 'H3.9' 'H3.6-6' 'H3.8-5' 'H3.8/4'
 'H3.9-5' 'CH3' 'R3.8-5' 'L3.9/4' 'E4' 'CO3' 'Chondrite-ung' 'H~5' 'H~6'
 'L/LL3.10' 'EL5' 'LL3' 'L~6' 'L~3' 'H~4' 'L(LL)3.5-3.7' 'Iron, IIIE-an'
 'H3.6' 'L3.4-3.7' 'L3.5' 'CM1/2' 'Martian (OPX)' 'Brachinite' 'LL7(?)'
 'LL6(?)' 'Eucrite-Mg rich' 'H3.5-4' 'EL3' 'R3.6' 'H3.5' 'CM1' 'L/LL3'
 'H7' 'L(?)3' 'L3.2' 'L3.7-3.9' 'Mesosiderite-B1' 'LL3.7' 'CO3.0' 'LL3.5'
 'L3.7-4' 'Eucrite-unbr' 'CV3-an' 'Lunar (anorth)' 'L3.3' 'Iron, IAB-sLM'
 'Lunar' 'Iron, IC' 'Iron, IID-an' 'Iron, IIIE' 'Iron, IVA-an' 'CK6'
 'L3.1' 'CK5' 'H3.3' 'H3.7-6' 'E6' 'H3.0' 'H3.1' 'L3.0' 'L/LL3.4' 'C6'
 'LL3.0' 'Lunar (gabbro)' 'R4' 'C4' 'Iron, IIG' 'Iron, IIC' 'H5-an'
 'EH4/5' 'Iron, IIIF' 'R3-6' 'Mesosiderite-B4' 'L6/7' 'L-imp melt' 'CK3'
 'H3-an' 'Iron, IVB' 'R3.8' 'L~5' 'Mesosiderite-an' 'Mesosiderite-A2'
 'Pallasite, PES' 'C4-ung' 'Iron, IAB?' 'Mesosiderite-A' 'R3.5-6' 'H3.9-6'
 'Ureilite-pmict' 'LL~6' 'CK4/5' 'EL4' 'Lunar (feldsp. breccia)' 'L3.9-6'
 'H-an' 'L/LL3-6' 'L/LL3-5' 'H/L3.5' 'H/L3' 'R3-4' 'CK3-an' 'LL4-5' 'H/L6'
 'L3/4' 'H-imp melt' 'CR' 'Chondrite-fusion crust' 'Iron, IAB-sLH'
 'H(L)3-an' 'L(LL)3' 'H(L)3' 'R3' 'L7' 'CM-an' 'L/LL~6' 'L/LL~5' 'L~4'
 'L/LL~4' 'LL(L)3' 'H3.2' 'L-melt breccia' 'H6-melt breccia'
 'H5-melt breccia' 'H-melt rock' 'Eucrite-an' 'Lunar (bas/anor)' 'LL5/6'
 'LL3/4' 'H3.4/3.5' 'Lunar (basalt)' 'H/L5' 'H(5?)' 'LL-imp melt'
 'Mesosiderite?' 'H~4/5' 'L6-melt breccia' 'L3.5-3.7' 'Iron, IIAB-an'
 'L3.3-3.7' 'L3.2-3.6' 'L3.3-3.6' 'Acapulcoite/Lodranite' 'Mesosiderite-B'
 'CK5/6' 'L3.05' 'C2' 'C4/5' 'L/LL3.2' 'Iron, IIIAB?' 'L3.5-5' 'L/LL(?)3'
 'H4(?)' 'Iron, IAB-sHH' 'Relict iron' 'EL4/5' 'L5-7' 'Diogenite-an' 'CR1'
 'H5 ' 'L5 ' 'H4 ' 'L4 ' 'E' 'L6 ' 'H3 ' 'LL6 ' 'H-metal' 'H6 ' 'L-metal'
 'Mesosiderite-A4' 'L/LL5/6' 'H3.8-4' 'CBb' 'EL6/7' 'EL7' 'CH/CBb' 'CO3.8'
 'H/L~4' 'Mesosiderite-C2' 'R5' 'H4/6' 'L-melt rock' 'H3.7-5' 'LL3.7-6'
 'H3.7/3.8' 'L3.7/3.8' 'EH-imp melt' 'R' 'Aubrite-an' 'R6' 'L3.5-3.9'
 'L3.2-3.5' 'L3.3-3.5' 'L3.0-3.7' 'E3-an' 'K' 'E3' 'CK4-an' 'Fusion crust'
 'L(LL)3.05' 'L3.10' 'Acapulcoite/lodranite' 'CB' 'LL-melt rock'
 'EL-melt rock' 'EH6' 'Pallasite, ungrouped' 'L/LL4/5' 'L3.8-an'
 'Iron, IAB-an' 'C5/6-ung' 'CV2' 'Iron, IC-an' 'Lunar (bas. breccia)'
 'L3.8-6' 'H3.05' 'H3.10' 'Iron, IAB-sHL-an' 'Achondrite-prim' 'LL3.05'
 'CK' 'Diogenite-olivine' 'LL3.8-4' 'C3.0-ung' 'LL-melt breccia'
 'LL6-melt breccia' 'L5-melt breccia' 'CO3.1' 'R3-5' 'LL6-an'
 'L4-melt breccia' 'Howardite-an' 'H4-melt breccia'
 'Martian (basaltic breccia)' 'L3-melt breccia' 'L~4-6' 'LL~5' 'R3.5-4'
 'CR7' 'H-melt breccia' 'Lunar (norite)' 'L3.00' 'H3.0-3.4' 'Relict OC'
 'L/LL4-6' 'EH7' 'L4-an' 'E-an' 'LL3-5' 'H3.8/3.9' 'L3.9-5' 'H3.8-6'
 'H3.4-5' 'L3.0-3.9' 'L3.5-3.8' 'H3.2-3.7' 'L3.6-4' 'L/LL3.6/3.7' 'H/L4-5'
 'Enst achon-ung' 'LL~3' 'Pallasite?' 'LL5-7' 'LL3.9/4' 'H3.8-an' 'CR-an'
 'L/LL5-6' 'L(LL)5' 'L(LL)6' 'LL3.1-3.5' 'LL3.1' 'E5' 'Lodranite-an'
 'H3.2-6' 'EH' 'H(?)4' 'E5-an' 'H3.2-an' 'EH6-an' 'Stone-ung' 'R3.9'
 'C1/2-ung' 'L/LL' 'CM' 'Mesosiderite-C']

L6                       7519
H5                       6243
H6                       3898
H4                       3880
L5                       3264
LL5                      2199
LL6                      1660
L4                        939
H4/5                      395
CM2                       330
H3                        313
CO3                       308
Iron, IIIAB               270
L3                        268
LL                        223
Ureilite                  214
E3                        205
LL4                       198
CV3                       184
Howardite                 179
Diogenite                 178
Eucrite-pmict             169
H5/6                      166
CR2                       116
Eucrite                   115
Iron, IIAB                111
Mesosiderite              107
H~5                       106
Iron, ungrouped           105
LL3                        88
                         ...
H3.2-3.7                    1
K                           1
LL6-an                      1
EH7                         1
H3.8-5                      1
L4-an                       1
CV2                         1
L/LL3.6/3.7                 1
H/L3.9                      1
L/LL                        1
H3.4/3.5                    1
R                           1
E5-an                       1
H/L3                        1
H3.7/3.8                    1
Iron, IAB-sHL-an            1
L4-melt breccia             1
R3-4                        1
L/LL5/6                     1
LL3.05                      1
L/LL4/5                     1
L/LL5-6                     1
Acapulcoite/lodranite       1
L3.7/3.8                    1
H3.8-4                      1
H(?)4                       1
L/LL~4                      1
EL4/5                       1
Iron, IIIE-an               1
L3.3-3.5                    1
Name: recclass, Length: 422, dtype: int64

In [10]:
df.drop(['nametype', 'fall'], axis=1, inplace=True)

In [11]:
df.head()

,name,id,recclass,mass (g),year,reclat,reclong,GeoLocation
0,Aachen,1,L5,21.0,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,H6,720.0,1/1/1951 0:00,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,EH4,107000.0,1/1/1952 0:00,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Acapulcoite,1914.0,1/1/1976 0:00,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,L6,780.0,1/1/1902 0:00,-33.16667,-64.95000,"(-33.16667, -64.95)"

Step 4: Standardization 
Now that we have dropped the columns that are not necessary we will now format the columns so that they are readable for our data set

In [12]:
# we need to minimize our year so it just says the year the meteor landed, not the whole date
df['year'].head()

0    01/01/1880 12:00:00 AM
1             1/1/1951 0:00
2             1/1/1952 0:00
3             1/1/1976 0:00
4             1/1/1902 0:00
Name: year, dtype: object

In [13]:
extr = df['year'].str.extract(pat="(\d{4})") # using regex we get the last 4 digits of each date
print(df['year'].head())
extr.head()

0    01/01/1880 12:00:00 AM
1             1/1/1951 0:00
2             1/1/1952 0:00
3             1/1/1976 0:00
4             1/1/1902 0:00
Name: year, dtype: object

      0
0  1880
1  1951
2  1952
3  1976
4  1902

In [18]:
# replace year with extr and label it year
df.drop(['year'], axis=1, inplace=True)
df.insert(loc=0, column='year', value=extr)

In [19]:
df.head() # should display only the year for year

,year,name,id,recclass,mass (g),reclat,reclong,GeoLocation
0,1880,Aachen,1,L5,21.0,50.77500,6.08333,"(50.775, 6.08333)"
1,1951,Aarhus,2,H6,720.0,56.18333,10.23333,"(56.18333, 10.23333)"
2,1952,Abee,6,EH4,107000.0,54.21667,-113.00000,"(54.21667, -113.0)"
3,1976,Acapulco,10,Acapulcoite,1914.0,16.88333,-99.90000,"(16.88333, -99.9)"
4,1902,Achiras,370,L6,780.0,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [21]:
# round reclat and reclong to 2 digits past the decimal point
# since the only floats are reclat, reclong, and mass: these will be the ones rounded
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38115 entries, 0 to 45715
Data columns (total 8 columns):
year           38115 non-null object
name           38115 non-null object
id             38115 non-null int64
recclass       38115 non-null object
mass (g)       38115 non-null float64
reclat         38115 non-null float64
reclong        38115 non-null float64
GeoLocation    38115 non-null object
dtypes: float64(3), int64(1), object(4)
memory usage: 2.6+ MB

In [36]:
df = df.round(decimals=2) # rounds to two decimal places

In [37]:
# replace Geolocation with input from reclat and reclong 
# should look like (reclat, reclong) to reclat, reclong
# if that is not possible just drop it and create a new GeoLocation column
df.drop(['GeoLocation'], axis=1)
df['GeoLocation'] = df['reclat'].map(str) + ", " + df['reclong'].map(str)
df.head()

   year      name   id     recclass  mass (g)  reclat  reclong     GeoLocation
0  1880    Aachen    1           L5      21.0   50.78     6.08     50.78, 6.08
1  1951    Aarhus    2           H6     720.0   56.18    10.23    56.18, 10.23
2  1952      Abee    6          EH4  107000.0   54.22  -113.00   54.22, -113.0
3  1976  Acapulco   10  Acapulcoite    1914.0   16.88   -99.90    16.88, -99.9
4  1902   Achiras  370           L6     780.0  -33.17   -64.95  -33.17, -64.95

Step 5: Check for Outliers

In [58]:
df.head()

   year      name   id     recclass  mass (g)  reclat  reclong     GeoLocation
0  1880    Aachen    1           L5      21.0   50.78     6.08     50.78, 6.08
1  1951    Aarhus    2           H6     720.0   56.18    10.23    56.18, 10.23
2  1952      Abee    6          EH4  107000.0   54.22  -113.00   54.22, -113.0
3  1976  Acapulco   10  Acapulcoite    1914.0   16.88   -99.90    16.88, -99.9
4  1902   Achiras  370           L6     780.0  -33.17   -64.95  -33.17, -64.95

In [ ]:
# the relevant attributes we need to look for outliers in are year, mass, relcat, reclong

Step 6: Check for Bad Data and Duplicates

In [38]:
df.isnull().sum()

year           0
name           0
id             0
recclass       0
mass (g)       0
reclat         0
reclong        0
GeoLocation    0
dtype: int64

In [57]:
duplicate_rows = df[df.duplicated()]
duplicate_rows

Empty DataFrame
Columns: [year, name, id, recclass, mass (g), reclat, reclong, GeoLocation]
Index: []

In [17]:
df.to_csv('data_set/M_Landings_cleaned.csv')